<?php


namespace Database\Seeders\Admin;


use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PostSeeder extends Seeder
{
    public function run()
    {
        DB::table('posts')->insert(
            [
                'title' => 'বিসিএস প্রিলিমিনারি প্রস্তুতি:বাংলা ভাষা ও সাহিত্য',
                'content' => 'বর্তমানে লাখো শিক্ষার্থী ও তরুণ-তরুণীর অন্যতম স্বপ্নের নাম বিসিএস। লাখ লাখ পরিক্ষার্থীকে পেছনে ফেলে
                                সফল হয়ে জয়ের মুকুট পরা জন্য  প্রয়োজন সুপরিকল্পিত প্রস্তুতি। বিসিএসে সাফল্যের পেতে “বাংলা ভাষা ও সাহিত্য” মূল চাবিকাঠি
                                হিসেবে কাজ করতে পারে। জেনে নেয়া যাক বিসিএস প্রিলির “বাংলা ভাষা ও সাহিত্য” বিষয়ে প্রস্তুতি কৌশল।
                                বিসিএস প্রিলিতে বাংলা ভাষা ও সাহিত্যবিষয়ে মোট ২০০ প্রশ্নের মধ্যে এই বিষয়ে ৩৫টি প্রশ্নের উত্তর দিতে হবে।
                                পূর্বের বিসিএস গুলিতে ২০ টি প্রশ্নের উত্তর দিতে হত। বিসিএস এ ভালো ফলাফল করার জন্য বাংলায় ভালো করার গুরুত্ব অপরিসীম।
                                এই বিষয়ে বাংলা সাহিত্য অংশের জন্য ২০ নম্বর এবং বাংলা ভাষা অংশের জন্য ১৫ নম্বর থাকে।',
                'category_id' => 1,
                'status_id' => 4,
                'user_id' => 1
            ]
        );

        DB::table('posts')->insert(
            [
                'title' => 'প্রাচীন যুগ ও বাংলা সাহিত্য',
                'content' => 'প্রাচীন যুগের প্রথমিক তথ্যের পাশাপাশি, চর্যাপদের আদ্যোপান্ত দেখে নিন। প্রথমে যে কোন একটি গাইড বই থেকে প্রয়োজনীয় তথ্যসমূহ পড়ে নিতে পারেন। বিস্তারিত জানার জন্য হুমায়ুন আজাদ রচিত “লাল নীল দীপাবলি” বইটি পড়তে পারেন। বিগত বছরের প্রশ্নগুলো গুরুত্ব দিয়ে পড়ুন।',
                'category_id' => 1,
                'status_id' => 4,
                'user_id' => 1
            ]
        );

        DB::table('posts')->insert(
            [
                'title' => 'মধ্যযুগ ও বাংলা সাহিত্য:',
                'content' => 'মধ্যযুগের জন্য শ্রীকৃষ্ণকীর্তন কাব্য, মঙ্গলকাব্য, বৈষ্ণব পদাবলী, মুসলিম সাহিত্য, অনুবাদ সাহিত্য ও গীতিকা গুরুত্ব দিয়ে পড়তে হবে।  প্রয়োজনীয় তথ্যসমূহের জন্য যে কোন একটি গাইড বই অনুসরণ করতে পারেন। বিস্তারিত জানার জন্য ড. সৌমিত্র শেখর রচিত  “বাংলা ভাষা ও সাহিত্য জিজ্ঞাসা” বইটি  দেখতে পারেন। বিগত বছরের প্রশ্নগুলোও গুরুত্ব দিয়ে পড়ুন।',
                'category_id' => 1,
                'status_id' => 4,
                'user_id' => 1
            ]
        );

        DB::table('posts')->insert(
            [
                'title' => 'আধুনিক যুগ ও বাংলা সাহিত্য:',
                'content' => 'বাংলা সাহিত্যে তিনটি যুগের মধ্যে আধুনিক যুগের সিলেবাস সবচেয়ে বড় এবং এবং অনেক কবি-সাহিত্যিকের তথ্য মনে রাখতে হয়।

০১. গদ্যের কথা এবং ফোর্ট উইলিয়াম কলেজের প্রয়োজনীয় তথ্যসমূহের জন্য যে কোন একটি গাইড বই অনুসরণ করুন।
০২. আধুনিক যুগের  কবি-লেখক: কবি-লেখকদের জীবনীর জন্য গুরুত্বপূর্ন কবি-লেখকদেরর তলিকা দেয়া হলো:

      ক. পিএসসি নির্ধারিত ১১ জন কবি-সাহিত্যিক:  বঙ্কিমচন্দ্র চট্টোপাধ্যায়, ঈশ্বরচন্দ্র বিদ্যাসাগর, মাইকেল মধুসূদন দত্ত, মীর মশাররফ হোসেন, রবীন্দ্রনাথ ঠাকুর, দীনবন্ধু মিত্র, কাজী নজরুল ইসলাম, জসীম উদ্দীন, ফররুক আহমদ, কায়কোবাদ এবং বেগম রোকেয়া সাখাওয়াত হোসেন',
                'category_id' => 1,
                'status_id' => 4,
                'user_id' => 1
            ]
        );

        DB::table('posts')->insert(
            [
                'title' => 'বিসিএস প্রিলিমিনারি প্রস্তুতি:বাংলা ভাষা ও সাহিত্য',
                'content' => 'বর্তমানে লাখো শিক্ষার্থী ও তরুণ-তরুণীর অন্যতম স্বপ্নের নাম বিসিএস। লাখ লাখ পরিক্ষার্থীকে পেছনে ফেলে
                                সফল হয়ে জয়ের মুকুট পরা জন্য  প্রয়োজন সুপরিকল্পিত প্রস্তুতি। বিসিএসে সাফল্যের পেতে “বাংলা ভাষা ও সাহিত্য” মূল চাবিকাঠি
                                হিসেবে কাজ করতে পারে। জেনে নেয়া যাক বিসিএস প্রিলির “বাংলা ভাষা ও সাহিত্য” বিষয়ে প্রস্তুতি কৌশল।
                                বিসিএস প্রিলিতে বাংলা ভাষা ও সাহিত্যবিষয়ে মোট ২০০ প্রশ্নের মধ্যে এই বিষয়ে ৩৫টি প্রশ্নের উত্তর দিতে হবে।
                                পূর্বের বিসিএস গুলিতে ২০ টি প্রশ্নের উত্তর দিতে হত। বিসিএস এ ভালো ফলাফল করার জন্য বাংলায় ভালো করার গুরুত্ব অপরিসীম।
                                এই বিষয়ে বাংলা সাহিত্য অংশের জন্য ২০ নম্বর এবং বাংলা ভাষা অংশের জন্য ১৫ নম্বর থাকে।',
                'category_id' => 3,
                'status_id' => 4,
                'user_id' => 1
            ]
        );

        DB::table('posts')->insert(
            [
                'title' => 'প্রাচীন যুগ ও বাংলা সাহিত্য',
                'content' => 'প্রাচীন যুগের প্রথমিক তথ্যের পাশাপাশি, চর্যাপদের আদ্যোপান্ত দেখে নিন। প্রথমে যে কোন একটি গাইড বই থেকে প্রয়োজনীয় তথ্যসমূহ পড়ে নিতে পারেন। বিস্তারিত জানার জন্য হুমায়ুন আজাদ রচিত “লাল নীল দীপাবলি” বইটি পড়তে পারেন। বিগত বছরের প্রশ্নগুলো গুরুত্ব দিয়ে পড়ুন।',
                'category_id' => 2,
                'status_id' => 4,
                'user_id' => 1
            ]
        );

        DB::table('posts')->insert(
            [
                'title' => 'মধ্যযুগ ও বাংলা সাহিত্য:',
                'content' => 'মধ্যযুগের জন্য শ্রীকৃষ্ণকীর্তন কাব্য, মঙ্গলকাব্য, বৈষ্ণব পদাবলী, মুসলিম সাহিত্য, অনুবাদ সাহিত্য ও গীতিকা গুরুত্ব দিয়ে পড়তে হবে।  প্রয়োজনীয় তথ্যসমূহের জন্য যে কোন একটি গাইড বই অনুসরণ করতে পারেন। বিস্তারিত জানার জন্য ড. সৌমিত্র শেখর রচিত  “বাংলা ভাষা ও সাহিত্য জিজ্ঞাসা” বইটি  দেখতে পারেন। বিগত বছরের প্রশ্নগুলোও গুরুত্ব দিয়ে পড়ুন।',
                'category_id' => 3,
                'status_id' => 4,
                'user_id' => 1
            ]
        );

        DB::table('posts')->insert(
            [
                'title' => 'আধুনিক যুগ ও বাংলা সাহিত্য:',
                'content' => 'বাংলা সাহিত্যে তিনটি যুগের মধ্যে আধুনিক যুগের সিলেবাস সবচেয়ে বড় এবং এবং অনেক কবি-সাহিত্যিকের তথ্য মনে রাখতে হয়।

০১. গদ্যের কথা এবং ফোর্ট উইলিয়াম কলেজের প্রয়োজনীয় তথ্যসমূহের জন্য যে কোন একটি গাইড বই অনুসরণ করুন।
০২. আধুনিক যুগের  কবি-লেখক: কবি-লেখকদের জীবনীর জন্য গুরুত্বপূর্ন কবি-লেখকদেরর তলিকা দেয়া হলো:

      ক. পিএসসি নির্ধারিত ১১ জন কবি-সাহিত্যিক:  বঙ্কিমচন্দ্র চট্টোপাধ্যায়, ঈশ্বরচন্দ্র বিদ্যাসাগর, মাইকেল মধুসূদন দত্ত, মীর মশাররফ হোসেন, রবীন্দ্রনাথ ঠাকুর, দীনবন্ধু মিত্র, কাজী নজরুল ইসলাম, জসীম উদ্দীন, ফররুক আহমদ, কায়কোবাদ এবং বেগম রোকেয়া সাখাওয়াত হোসেন',
                'category_id' => 2,
                'status_id' => 4,
                'user_id' => 1
            ]
        );
    }
}
